## Задача 1. Строки. 

1.6.1.1. Запросить у пользователя текст `t1` и вывести текст `t2`, составленый из последних букв каждого слова в тексте `t1`(игнорировать занки припинания).

### Пример
Пример 1
```
Введите текст:
Привет, меня зовут Паша.
тята
```

1.6.1.2. Запросить у пользователя текст подсчитать количество слов, начинающихся с прописной буквы (с большой буквы) и вывести ответ.

### Пример
Пример 1
```
Введите текст:
Привет, меня зовут Паша.
2
```

1.6.1.3. Запросить у пользователя текст и вывести данный текст без лишних пробелов если пробелы в начале или в конце текста, то убрать все пробелы, а если между словами оставлять один пробел, убирать остальные.

### Пример
Пример 1
```
Введите текст:
			This       is      sentences          
This is sentences          
```

1.6.1.4. Напишите программу, которая запрашивает у пользователя текст `t` и букву `c` в данном случае ('a' == 'A') и вывести индекс последнего символа в тексте `t` которые соответствует букве `c`. Если не имеется символа `с` в тексте `t`, то выводить -1.

### Пример
Пример 1
```
Введите текст:
This Is sentences
Введите букву:
i
5        
```

1.6.1.5. Напишите программу, которая запрашивает у пользователя текст `t` и букву `c` в данном случае ('a' == 'A') и заменяет символ `с` в тексте `t` на `*`.

### Пример
Пример 1
```
Введите текст:
This Is sentences
Введите букву:
i
Th*s *s sentences      
```

## Инструкция по выполнению домашнего задания

- Первый вариант

1. Зарегистрируйтесь на сайте <a href="http://repl.it/" target="_blank">Repl.IT</a>.
2. Перейдите в раздел **my repls**.
3. Нажмите кнопку **Start coding now!**, если приступаете впервые, или **New Repl**, если у вас уже есть работы.
4. В списке языков выберите `C#`.
5. В поле название repl напишите номер задачи, например: `lab1_1_1`.
6. Код пишите в левой части окна вместо строки `Console.WriteLine ("Hello World");;`.
7. Посмотреть результат выполнения файла можно, нажав на кнопку **Run**. Результат появится в правой части окна.
8. После окончания работы нажмите кнопку **Share** и скопируйте ссылку из поля Share link.
9. В классе на сайте <a href="https://classroom.google.com/c/MjM5MzEwOTA3NTJa" target="_blank">classroom.google</a> в поле комментария к домашней работе вставьте скопированную ссылку и отправьте работу на проверку.

*Никаких файлов прикреплять не нужно.*

- Второй вариант

1. Создайте папку с названием лабораторной работы, например: `lab1_1_1`.
2. Откройте программу VisualStudio Code.
3. Откройте, созданную вами папку в VisualStudio Code.
3. Создайте проект при помощи командной строки командой 
`$ dotnet new console`.
4. Откройте файл `Program.cs` в текстовом редакторе.
5. Код пишите в правом окне вместо строки `Console.WriteLine ("Hello World");;`.
6. Посмотреть результат выполнения файла можно, написав команду `$ dotnet run`. Результат появится в нижней части окна.
7. После окончания работы заархивируйте папку с название лабораторной работы в zip архив.
8. В классе на сайте <a href="https://classroom.google.com/c/MjM5MzEwOTA3NTJa" target="_blank">classroom.google</a> в поле комментария к домашней работе вставьте zip архив проекта и отправьте работу на проверку.

*Для подробной информации перейдите по <a href="https://docs.microsoft.com/ru-ru/dotnet/core/tutorials/with-visual-studio-code" target="_blank">ссылке</a>.*